#Задание 1
age = int(input('введите число: '))
delta = 2
sum = age + delta
print (sum)